{"columns":["join the club","tie one","butter s\/one up","pull the strings","blow a fuse","drop the subject","twist arm","sail close to wind"],"index":["sentence0","sentence1","sentence2","sentence3","interaction score","idiomatic score","non idiomatic score"],"data":[["Join the club! I'm also really exhausted from work.","At the party last night I tied one on.","I blushed when he butter me up with nice words.","There is a king, but in reality the consultant is pulling the strings.","When he found out, he completely blew a fuse and started yelling at the team.","Please drop the subject. Let's talk about something else.","No one twisted my arm about seeing you.","The kid teased its parents as it like sailing close to the wind."],["Me too! I'm also really exhausted from work.","At the party last night I got drunk.","I blushed when he flattered me with nice words.","There is a king, but in reality the consultant is controlling the situation.","When he found out, he completely lost his temper and started yelling at the team.","Please change the topic. Let's talk about something else.","No one forced me to see you.","The kid teased its parents as it liked pushing the boundaries."],["Join the club! It's a nice extracurriculum.","Here are the ropes. Tie one on before climbing the mountain.","Here is the sandwich. I have buttered it up.","Maria was sewing. Before every new stitch she pulled the string.","As he worked on the plug electricity went out. He blew the fuse.","As the object of investigation was carried to the lab, the scientist dropped the subject.","Hit me and I will twist your arm.","When on a boat, try sailing close to the wind."],["Me too! It's a nice extracurriculum.","Here are the ropes. Get drunk before climbing the mountain.","Here is the sandwich. I have flattered it.","Maria was sewing. Before every new stitch she controlled the situation.","As he worked on the plug electricity went out. He got angry.","As the object of investigation was carried to the lab, the scientist changed the topic.","Hit me and I will force you.","When on a boat, try pushing the boundaries."],[0.0855295062,0.330268085,-0.0814637542,-0.149343133,-0.1048914194,0.0616257191,-0.0174232125,-0.0622093081],[0.6388781071,0.4922801852,0.921186924,0.9721466303,0.8923157454,0.7165950537,0.5982652307,0.7127800584],[0.7244076133,0.8225482702,0.8397231698,0.8228034973,0.7874243259,0.7782207727,0.5808420181,0.6505707502]]}