{"columns":["come clean","get on board","drop ball","stuck to guns","pick up the slack","have a field day","crack the whip","butter s\/one up","pick s\/one's brain"],"index":["sentence0","sentence1","sentence2","sentence3","interaction score","idiomatic score","non idiomatic score"],"data":[["The government should come clean about its plans.","We cannot expect other countries to get on board if we don't set a good example.","The government seems to have dropped the ball on it.","He should have stuck to his guns and leave her.","Without another contract to help pick up the slack, employees may face job losses.","The newspapers had a field day when the trial finished.","As editor, Dorothy likes to crack the whip.","Don't think you can butter me up that easily.","Have you got a minute? I need to pick your brains."],["The government should tell the truth about its plans.","We cannot expect other countries to join if we don't set a good example.","The government seems to have lost control over it.","He should have refused to change his decision and leave her.","Without another contract to help enhance effectiveness, employees may face job losses.","The newspapers could criticize freely when the trial finished.","As editor, Dorothy likes to make people very hard.","Don't think you can flatter me that easily.","Have you got a minute? I need to ask you some information."],["He came clean to the party.","Don't be afraid of falling into the water, get on board.","She dropped the ball when he scared her.","She stuck to her gun to be able to protect herself.","The sail is not working, pick up that slack!","Next year I will ahve more field days in the nature.","Crack the whip if you want your horses win the competition.","I have buttered her hair up during the dinner.","I had to pick her brain from the hospital."],["He told the truth at the party.","Don't be afraid of falling into the water, join us.","She lost control when he scared her.","She refused to change her decision to protect herself.","The sail is not working, be more efficient!","Next year I will criticize more in the nature.","Make people work hard if you want your horses win the competition.","I have complemented her hair during the dinner.","I had to ask her for some information in the hospital."],[-0.0291437507,-0.0021021962,0.0520346165,-0.0071262121,-0.0098111629,0.0258311033,0.0048209429,-0.0037827492,0.0383642912],[0.9981742501,0.9986959696,0.8943974972,0.9953483343,0.9968514442,0.9672008157,0.9900068045,0.9989647269,0.9451519251],[0.9690304995,0.9965937734,0.9464321136,0.9882221222,0.9870402813,0.993031919,0.9948277473,0.9951819777,0.9835162163]]}