{"columns":["come clean","get on board","drop ball","stuck to guns","pick up the slack","have a field day","crack the whip","butter s\/one up","pick s\/one's brain"],"index":["sentence0","sentence1","sentence2","sentence3","interaction score","idiomatic score","non idiomatic score"],"data":[["The government should come clean about its plans.","We cannot expect other countries to get on board if we don't set a good example.","The riots on the streets show the government has dropped the ball.","He should have stuck to his guns and leave her.","Without another contract to help pick up the slack, employees may face job losses.","The newspapers had a field day when the scandal was uncovered.","As editor, Dorothy likes to crack the whip.","Don't think you can butter me up that easily.","This is so interesting. I need to pick your brains on this."],["The government should tell the truth about its plans.","We cannot expect other countries to join if we don't set a good example.","The riots on the streets show the government has lost control.","He should have refused to change his decision and leave her.","Without another contract to help enhance effectiveness, employees may face job losses.","The newspapers happily took advantage when the scandal was uncovered.","As editor, Dorothy likes to make people very hard.","Don't think you can flatter me that easily.","This is so interesting. I need to question you on this."],["He came clean to the party.","Don't be afraid of falling into the water, get on board.","He was just about to throw to the pitcher when he dropped the ball.","She stuck to her gun to be able to protect herself.","The sail is not working, pick up that slack!","Next year I will have more field days in the nature.","Crack the whip if you want your horses win the competition.","I have buttered her hair up during the dinner.","The doctor picked her brain during surgery."],["He told the truth at the party.","Don't be afraid of falling into the water, join us.","He was just about to throw to the pitcher when he lost control.","She refused to change her decision to protect herself.","The sail is not working, be more efficient!","Next year I will happily take advantage in the nature.","Make people work hard if you want your horses win the competition.","I have complemented her hair during the dinner.","The doctor questioned her during surgery."],[-0.0291437507,-0.0021021962,-0.0139139891,-0.0071262121,-0.0098111629,0.001237154,0.0048209429,-0.0037827492,0.0415055752],[0.9981742501,0.9986959696,0.9959244132,0.9953483343,0.9968514442,0.9950215816,0.9900068045,0.9989647269,0.9486697912],[0.9690304995,0.9965937734,0.9820104241,0.9882221222,0.9870402813,0.9962587357,0.9948277473,0.9951819777,0.9901753664]]}